MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFG144/mcu.h
extern volatile __ABF2DEVCFG2bits_t ABF2DEVCFG2bits __asm__ ("ABF2DEVCFG2") __attribute__((section("sfrs"), address(0xBFC6FF44)));
#define ABF2DEVCFG1 ABF2DEVCFG1
extern volatile uint32_t   ABF2DEVCFG1 __attribute__((section("sfrs"), address(0xBFC6FF48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG1bits_t;
extern volatile __ABF2DEVCFG1bits_t ABF2DEVCFG1bits __asm__ ("ABF2DEVCFG1") __attribute__((section("sfrs"), address(0xBFC6FF48)));
#define ABF2DEVCFG0 ABF2DEVCFG0
extern volatile uint32_t   ABF2DEVCFG0 __attribute__((section("sfrs"), address(0xBFC6FF4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t :8;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG0bits_t;
extern volatile __ABF2DEVCFG0bits_t ABF2DEVCFG0bits __asm__ ("ABF2DEVCFG0") __attribute__((section("sfrs"), address(0xBFC6FF4C)));
#define ABF2DEVCP3 ABF2DEVCP3
extern volatile uint32_t   ABF2DEVCP3 __attribute__((section("sfrs"), address(0xBFC6FF50)));
#define ABF2DEVCP2 ABF2DEVCP2
extern volatile uint32_t   ABF2DEVCP2 __attribute__((section("sfrs"), address(0xBFC6FF54)));
#define ABF2DEVCP1 ABF2DEVCP1
extern volatile uint32_t   ABF2DEVCP1 __attribute__((section("sfrs"), address(0xBFC6FF58)));
#define ABF2DEVCP0 ABF2DEVCP0
extern volatile uint32_t   ABF2DEVCP0 __attribute__((section("sfrs"), address(0xBFC6FF5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCP0bits_t;
extern volatile __ABF2DEVCP0bits_t ABF2DEVCP0bits __asm__ ("ABF2DEVCP0") __attribute__((section("sfrs"), address(0xBFC6FF5C)));
#define ABF2DEVSIGN3 ABF2DEVSIGN3
extern volatile uint32_t   ABF2DEVSIGN3 __attribute__((section("sfrs"), address(0xBFC6FF60)));
#define ABF2DEVSIGN2 ABF2DEVSIGN2
extern volatile uint32_t   ABF2DEVSIGN2 __attribute__((section("sfrs"), address(0xBFC6FF64)));
#define ABF2DEVSIGN1 ABF2DEVSIGN1
extern volatile uint32_t   ABF2DEVSIGN1 __attribute__((section("sfrs"), address(0xBFC6FF68)));
#define ABF2DEVSIGN0 ABF2DEVSIGN0
extern volatile uint32_t   ABF2DEVSIGN0 __attribute__((section("sfrs"), address(0xBFC6FF6C)));
#define ABF2SEQ3 ABF2SEQ3
extern volatile uint32_t   ABF2SEQ3 __attribute__((section("sfrs"), address(0xBFC6FF70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2SEQ3bits_t;
extern volatile __ABF2SEQ3bits_t ABF2SEQ3bits __asm__ ("ABF2SEQ3") __attribute__((section("sfrs"), address(0xBFC6FF70)));
#define ABF2SEQ2 ABF2SEQ2
extern volatile uint32_t   ABF2SEQ2 __attribute__((section("sfrs"), address(0xBFC6FF74)));
#define ABF2SEQ1 ABF2SEQ1
extern volatile uint32_t   ABF2SEQ1 __attribute__((section("sfrs"), address(0xBFC6FF78)));
#define ABF2SEQ0 ABF2SEQ0
extern volatile uint32_t   ABF2SEQ0 __attribute__((section("sfrs"), address(0xBFC6FF7C)));
#define BF2DEVCFG3 BF2DEVCFG3
extern volatile uint32_t   BF2DEVCFG3 __attribute__((section("sfrs"), address(0xBFC6FFC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCFG3bits_t;
extern volatile __BF2DEVCFG3bits_t BF2DEVCFG3bits __asm__ ("BF2DEVCFG3") __attribute__((section("sfrs"), address(0xBFC6FFC0)));
#define BF2DEVCFG2 BF2DEVCFG2
extern volatile uint32_t   BF2DEVCFG2 __attribute__((section("sfrs"), address(0xBFC6FFC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :11;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCFG2bits_t;
extern volatile __BF2DEVCFG2bits_t BF2DEVCFG2bits __asm__ ("BF2DEVCFG2") __attribute__((section("sfrs"), address(0xBFC6FFC4)));
#define BF2DEVCFG1 BF2DEVCFG1
extern volatile uint32_t   BF2DEVCFG1 __attribute__((section("sfrs"), address(0xBFC6FFC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCFG1bits_t;
extern volatile __BF2DEVCFG1bits_t BF2DEVCFG1bits __asm__ ("BF2DEVCFG1") __attribute__((section("sfrs"), address(0xBFC6FFC8)));
#define BF2DEVCFG0 BF2DEVCFG0
extern volatile uint32_t   BF2DEVCFG0 __attribute__((section("sfrs"), address(0xBFC6FFCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t :8;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCFG0bits_t;
extern volatile __BF2DEVCFG0bits_t BF2DEVCFG0bits __asm__ ("BF2DEVCFG0") __attribute__((section("sfrs"), address(0xBFC6FFCC)));
#define BF2DEVCP3 BF2DEVCP3
extern volatile uint32_t   BF2DEVCP3 __attribute__((section("sfrs"), address(0xBFC6FFD0)));
#define BF2DEVCP2 BF2DEVCP2
extern volatile uint32_t   BF2DEVCP2 __attribute__((section("sfrs"), address(0xBFC6FFD4)));
#define BF2DEVCP1 BF2DEVCP1
extern volatile uint32_t   BF2DEVCP1 __attribute__((section("sfrs"), address(0xBFC6FFD8)));
#define BF2DEVCP0 BF2DEVCP0
extern volatile uint32_t   BF2DEVCP0 __attribute__((section("sfrs"), address(0xBFC6FFDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF2DEVCP0bits_t;
extern volatile __BF2DEVCP0bits_t BF2DEVCP0bits __asm__ ("BF2DEVCP0") __attribute__((section("sfrs"), address(0xBFC6FFDC)));
#define BF2DEVSIGN3 BF2DEVSIGN3
extern volatile uint32_t   BF2DEVSIGN3 __attribute__((section("sfrs"), address(0xBFC6FFE0)));
#define BF2DEVSIGN2 BF2DEVSIGN2
extern volatile uint32_t   BF2DEVSIGN2 __attribute__((section("sfrs"), address(0xBFC6FFE4)));
#define BF2DEVSIGN1 BF2DEVSIGN1
extern volatile uint32_t   BF2DEVSIGN1 __attribute__((section("sfrs"), address(0xBFC6FFE8)));
#define BF2DEVSIGN0 BF2DEVSIGN0
extern volatile uint32_t   BF2DEVSIGN0 __attribute__((section("sfrs"), address(0xBFC6FFEC)));
#define BF2SEQ3 BF2SEQ3
extern volatile uint32_t   BF2SEQ3 __attribute__((section("sfrs"), address(0xBFC6FFF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __BF2SEQ3bits_t;
extern volatile __BF2SEQ3bits_t BF2SEQ3bits __asm__ ("BF2SEQ3") __attribute__((section("sfrs"), address(0xBFC6FFF0)));
#define BF2SEQ2 BF2SEQ2
extern volatile uint32_t   BF2SEQ2 __attribute__((section("sfrs"), address(0xBFC6FFF4)));
#define BF2SEQ1 BF2SEQ1
extern volatile uint32_t   BF2SEQ1 __attribute__((section("sfrs"), address(0xBFC6FFF8)));
#define BF2SEQ0 BF2SEQ0
extern volatile uint32_t   BF2SEQ0 __attribute__((section("sfrs"), address(0xBFC6FFFC)));
#ifdef __cplusplus
}
#endif

