MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFG144/mcu.h
#define _CNNEE_CNNEE3_POSITION                   0x00000003
#define _CNNEE_CNNEE3_MASK                       0x00000008
#define _CNNEE_CNNEE3_LENGTH                     0x00000001

#define _CNFE_CNFE0_POSITION                     0x00000000
#define _CNFE_CNFE0_MASK                         0x00000001
#define _CNFE_CNFE0_LENGTH                       0x00000001

#define _CNFE_CNFE1_POSITION                     0x00000001
#define _CNFE_CNFE1_MASK                         0x00000002
#define _CNFE_CNFE1_LENGTH                       0x00000001

#define _CNFE_CNFE2_POSITION                     0x00000002
#define _CNFE_CNFE2_MASK                         0x00000004
#define _CNFE_CNFE2_LENGTH                       0x00000001

#define _CNFE_CNFE3_POSITION                     0x00000003
#define _CNFE_CNFE3_MASK                         0x00000008
#define _CNFE_CNFE3_LENGTH                       0x00000001

#define _CNFE_CNFE4_POSITION                     0x00000004
#define _CNFE_CNFE4_MASK                         0x00000010
#define _CNFE_CNFE4_LENGTH                       0x00000001

#define _CNFE_CNFE5_POSITION                     0x00000005
#define _CNFE_CNFE5_MASK                         0x00000020
#define _CNFE_CNFE5_LENGTH                       0x00000001

#define _CNFE_CNFE6_POSITION                     0x00000006
#define _CNFE_CNFE6_MASK                         0x00000040
#define _CNFE_CNFE6_LENGTH                       0x00000001

#define _CNFE_CNFE7_POSITION                     0x00000007
#define _CNFE_CNFE7_MASK                         0x00000080
#define _CNFE_CNFE7_LENGTH                       0x00000001

#define _CNFE_CNFE8_POSITION                     0x00000008
#define _CNFE_CNFE8_MASK                         0x00000100
#define _CNFE_CNFE8_LENGTH                       0x00000001

#define _CNFE_CNFE9_POSITION                     0x00000009
#define _CNFE_CNFE9_MASK                         0x00000200
#define _CNFE_CNFE9_LENGTH                       0x00000001

#define _CNFE_CNFE10_POSITION                    0x0000000A
#define _CNFE_CNFE10_MASK                        0x00000400
#define _CNFE_CNFE10_LENGTH                      0x00000001

#define _CNFE_CNFE11_POSITION                    0x0000000B
#define _CNFE_CNFE11_MASK                        0x00000800
#define _CNFE_CNFE11_LENGTH                      0x00000001

#define _CNFE_CNFE12_POSITION                    0x0000000C
#define _CNFE_CNFE12_MASK                        0x00001000
#define _CNFE_CNFE12_LENGTH                      0x00000001

#define _CNFE_CNFE13_POSITION                    0x0000000D
#define _CNFE_CNFE13_MASK                        0x00002000
#define _CNFE_CNFE13_LENGTH                      0x00000001

#define _CNFE_CNFE14_POSITION                    0x0000000E
#define _CNFE_CNFE14_MASK                        0x00004000
#define _CNFE_CNFE14_LENGTH                      0x00000001

#define _CNFE_CNFE15_POSITION                    0x0000000F
#define _CNFE_CNFE15_MASK                        0x00008000
#define _CNFE_CNFE15_LENGTH                      0x00000001

#define _SRCON0E_SR0E0_POSITION                  0x00000000
#define _SRCON0E_SR0E0_MASK                      0x00000001
#define _SRCON0E_SR0E0_LENGTH                    0x00000001

#define _SRCON0E_SR0E1_POSITION                  0x00000001
#define _SRCON0E_SR0E1_MASK                      0x00000002
#define _SRCON0E_SR0E1_LENGTH                    0x00000001

#define _SRCON0E_SR0E2_POSITION                  0x00000002
#define _SRCON0E_SR0E2_MASK                      0x00000004
#define _SRCON0E_SR0E2_LENGTH                    0x00000001

#define _SRCON0E_SR0E3_POSITION                  0x00000003
#define _SRCON0E_SR0E3_MASK                      0x00000008
#define _SRCON0E_SR0E3_LENGTH                    0x00000001

#define _SRCON0E_SR0E4_POSITION                  0x00000004
#define _SRCON0E_SR0E4_MASK                      0x00000010
#define _SRCON0E_SR0E4_LENGTH                    0x00000001

#define _SRCON0E_SR0E5_POSITION                  0x00000005
#define _SRCON0E_SR0E5_MASK                      0x00000020
#define _SRCON0E_SR0E5_LENGTH                    0x00000001

#define _SRCON0E_SR0E6_POSITION                  0x00000006
#define _SRCON0E_SR0E6_MASK                      0x00000040
#define _SRCON0E_SR0E6_LENGTH                    0x00000001

#define _SRCON0E_SR0E7_POSITION                  0x00000007
#define _SRCON0E_SR0E7_MASK                      0x00000080
#define _SRCON0E_SR0E7_LENGTH                    0x00000001

#define _SRCON0E_SR0E8_POSITION                  0x00000008
#define _SRCON0E_SR0E8_MASK                      0x00000100
#define _SRCON0E_SR0E8_LENGTH                    0x00000001

#define _SRCON0E_SR0E9_POSITION                  0x00000009
#define _SRCON0E_SR0E9_MASK                      0x00000200
#define _SRCON0E_SR0E9_LENGTH                    0x00000001

#define _SRCON0E_SR0E10_POSITION                 0x0000000A
#define _SRCON0E_SR0E10_MASK                     0x00000400
#define _SRCON0E_SR0E10_LENGTH                   0x00000001

#define _SRCON0E_SR0E11_POSITION                 0x0000000B
#define _SRCON0E_SR0E11_MASK                     0x00000800
#define _SRCON0E_SR0E11_LENGTH                   0x00000001

#define _SRCON0E_SR0E12_POSITION                 0x0000000C
#define _SRCON0E_SR0E12_MASK                     0x00001000
#define _SRCON0E_SR0E12_LENGTH                   0x00000001

#define _SRCON0E_SR0E13_POSITION                 0x0000000D
#define _SRCON0E_SR0E13_MASK                     0x00002000
#define _SRCON0E_SR0E13_LENGTH                   0x00000001

#define _SRCON0E_SR0E14_POSITION                 0x0000000E
#define _SRCON0E_SR0E14_MASK                     0x00004000
#define _SRCON0E_SR0E14_LENGTH                   0x00000001

#define _SRCON0E_SR0E15_POSITION                 0x0000000F
#define _SRCON0E_SR0E15_MASK                     0x00008000
#define _SRCON0E_SR0E15_LENGTH                   0x00000001

#define _SRCON1E_SR1E0_POSITION                  0x00000000
#define _SRCON1E_SR1E0_MASK                      0x00000001
#define _SRCON1E_SR1E0_LENGTH                    0x00000001

